Repository: Unixcision/uniconnect
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, km, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# cli.rightSidebar.usage
source: Usage: cmux right-sidebar <command> [flags] Control the right sidebar from the CLI. Commands: toggle Toggle right sidebar visibility show Show the right sidebar hide Hide the right sidebar focus Focus the current right sidebar mode set <files|find|vault|sessions|feed|dock> Show, switch mode, and focus mode Print {"visible":bool,"mode":string} files|find|vault|sessions|feed|dock Alias for show + set + focus Flags: --workspace <id|ref|index> Target the window containing a workspace --window <id|ref|index> Target a window --no-focus With set, switch mode without moving focus Examples: cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode
ar: الاستخدام: cmux right-sidebar <command> [flags] التحكم في الشريط الجانبي الأيمن من CLI. الأوامر: toggle تبديل رؤية الشريط الجانبي الأيمن show إظهار الشريط الجانبي الأيمن hide إخفاء الشريط الجانبي الأيمن focus قم بالتركيز على وضع الشريط الجانبي الأيمن الحالي set <files|find|vault|sessions|feed|dock> العرض وتبديل الوضع والتركيز mode طباعة {"visible":bool,"mode":string} files|find|vault|sessions|feed|dock الاسم المستعار لـ show + set + focus الأعلام: --workspace <id|ref|index> استهدف النافذة التي تحتوي على مساحة عمل --window <id|ref|index> استهدف نافذة --no-focus مع الضبط، قم بتبديل الوضع دون تحريك التركيز أمثلة: cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode
bs: Upotreba: cmux right-sidebar <command> [flags] Kontrolirajte desnu bočnu traku sa CLI. naredbe: toggle Uključite vidljivost desne bočne trake show Prikaži desnu bočnu traku hide Sakrij desnu bočnu traku focus Fokusirajte trenutni režim desne bočne trake set <files|find|vault|sessions|feed|dock> Prikažite, promijenite način rada i fokus mode Ispiši {"visible":bool,"mode":string} files|find|vault|sessions|feed|dock Alias za show + set + focus zastave: --workspace <id|ref|index> Ciljajte prozor koji sadrži radni prostor --window <id|ref|index> Ciljajte prozor --no-focus Sa postavljenim, promijenite način rada bez pomicanja fokusa primjeri: cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode
da: Anvendelse: cmux right-sidebar <command> [flags] Styr den højre sidebjælke fra CLI. Kommandoer: toggle Skift højre sidebjælkesynlighed show Vis den højre sidebjælke hide Skjul den højre sidebjælke focus Fokuser på den aktuelle højre sidebjælketilstand set <files|find|vault|sessions|feed|dock> Vis, skift tilstand og fokus mode Udskriv {"visible":bool,"mode":string} files|find|vault|sessions|feed|dock Alias for show + set + focus Flag: --workspace <id|ref|index> Målret mod vinduet, der indeholder et arbejdsområde --window <id|ref|index> Målret mod et vindue --no-focus Med indstillet, skift tilstand uden at flytte fokus Eksempler: cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode
de: Verwendung: cmux right-sidebar <command> [flags] Steuern Sie die rechte Seitenleiste über CLI. Befehle: toggle Sichtbarkeit der rechten Seitenleiste umschalten show Zeigt die rechte Seitenleiste an hide Die rechte Seitenleiste ausblenden focus Fokussieren Sie den aktuellen rechten Seitenleistenmodus set <files|find|vault|sessions|feed|dock> Anzeigen, Modus wechseln und fokussieren mode Drucken {"visible":bool,"mode":string} files|find|vault|sessions|feed|dock Alias für show + set + focus Flaggen: --workspace <id|ref|index> Zielen Sie auf das Fenster, das einen Arbeitsbereich enthält --window <id|ref|index> Zielen Sie auf ein Fenster --no-focus Mit der Einstellung können Sie den Modus wechseln, ohne den Fokus zu verschieben Beispiele: cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode
es: Uso: cmux right-sidebar <command> [flags] Controla la barra lateral derecha desde la CLI. Comandos: toggle Alterna la visibilidad de la barra lateral derecha show Muestra la barra lateral derecha hide Oculta la barra lateral derecha focus Enfoca el modo actual de la barra lateral derecha set <files|find|vault|sessions|feed|dock> Muestra, cambia de modo y enfoca mode Imprime {"visible":bool,"mode":string} files|find|vault|sessions|feed|dock Alias de show + set + focus Opciones: --workspace <id|ref|index> Apunta a la ventana que contiene un espacio de trabajo --window <id|ref|index> Apunta a una ventana --no-focus Con set, cambia de modo sin mover el foco Ejemplos: cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode
fr: Utilisation : cmux right-sidebar <command> [flags] Contrôlez la barre latérale droite à partir du CLI. Commandes : toggle Basculer la visibilité de la barre latérale droite show Afficher la barre latérale droite hide Masquer la barre latérale droite focus Focus sur le mode actuel de la barre latérale droite set <files|find|vault|sessions|feed|dock> Afficher, changer de mode et se concentrer mode Imprimer {"visible":bool,"mode":string} files|find|vault|sessions|feed|dock Alias pour show + set + focus Drapeaux : --workspace <id|ref|index> Ciblez la fenêtre contenant un espace de travail --window <id|ref|index> Cibler une fenêtre --no-focus Avec réglage, changement de mode sans déplacement de la mise au point Exemples : cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode
it: Utilizzo: cmux right-sidebar <command> [flags] Controlla la barra laterale destra da CLI. Comandi: toggle Attiva/disattiva la visibilità della barra laterale destra show Mostra la barra laterale destra hide Nascondi la barra laterale destra focus Evidenzia la modalità corrente della barra laterale destra set <files|find|vault|sessions|feed|dock> Mostra, cambia modalità e metti a fuoco mode Stampa {"visible":bool,"mode":string} files|find|vault|sessions|feed|dock Alias per show + set + focus Bandiere: --workspace <id|ref|index> Scegli come target la finestra contenente un'area di lavoro --window <id|ref|index> Scegli come target una finestra --no-focus Con l'impostazione, cambia modalità senza spostare il focus Esempi: cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode
ja: 使用法: cmux right-sidebar <command> [flags] CLI から右側のサイドバーを制御します。 コマンド: toggle 右サイドバーの表示/非表示を切り替えます show 右サイドバーを表示 hide 右側のサイドバーを非表示にする focus 現在の右側のサイドバー モードにフォーカスします set <files|find|vault|sessions|feed|dock> 表示、モード切り替え、フォーカス mode 印刷 {"visible":bool,"mode":string} files|find|vault|sessions|feed|dock show + set + focus のエイリアス フラグ: --workspace <id|ref|index> ワークスペースを含むウィンドウをターゲットにします --window <id|ref|index> ウィンドウをターゲットにする --no-focus セットすると、フォーカスを移動せずにモードを切り替えます 例: cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode
km: ការប្រើប្រាស់៖ cmux right-sidebar <command> [flags] គ្រប់គ្រងរបារចំហៀងខាងស្តាំពី CLI។ ពាក្យបញ្ជា៖ toggle បិទ/បើកលទ្ធភាពមើលឃើញរបារចំហៀងខាងស្តាំ show បង្ហាញរបារចំហៀងខាងស្តាំ hide លាក់របារចំហៀងខាងស្តាំ focus ផ្តោតលើរបៀបរបារចំហៀងខាងស្តាំបច្ចុប្បន្ន set <files|find|vault|sessions|feed|dock> បង្ហាញ ប្តូររបៀប និងផ្ដោត mode បោះពុម្ព {"visible":bool,"mode":string} files|find|vault|sessions|feed|dock ឈ្មោះក្លែងក្លាយសម្រាប់ show + set + focus ទង់ជាតិ៖ --workspace <id|ref|index> កំណត់គោលដៅបង្អួចដែលមានកន្លែងធ្វើការ --window <id|ref|index> កំណត់គោលដៅបង្អួច --no-focus ជា​មួយ​នឹង​ការ​កំណត់ សូម​ប្ដូរ​របៀប​ដោយ​មិន​ចាំបាច់​ផ្លាស់ទី​ការ​ផ្ដោត ឧទាហរណ៍៖ cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode
ko: 사용법: cmux right-sidebar <command> [flags] CLI에서 오른쪽 사이드바를 제어하세요. 명령: toggle 오른쪽 사이드바 가시성 전환 show 오른쪽 사이드바 표시 hide 오른쪽 사이드바 숨기기 focus 현재 오른쪽 사이드바 모드에 초점을 맞춥니다. set <files|find|vault|sessions|feed|dock> 표시, 모드 전환 및 초점 mode 인쇄 {"visible":bool,"mode":string} files|find|vault|sessions|feed|dock show + set + focus의 별칭 플래그: --workspace <id|ref|index> 작업 공간이 포함된 창을 대상으로 합니다. --window <id|ref|index> 창 타겟팅 --no-focus 설정 시 초점 이동 없이 모드 전환 예: cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode
nb: Bruk: cmux right-sidebar <command> [flags] Kontroller høyre sidefelt fra CLI. Kommandoer: toggle Slå høyre sidefelts synlighet show Vis høyre sidefelt hide Skjul høyre sidefelt focus Fokuser gjeldende høyre sidefeltmodus set <files|find|vault|sessions|feed|dock> Vis, bytt modus og fokus mode Skriv ut {"visible":bool,"mode":string} files|find|vault|sessions|feed|dock Alias for show + set + focus Flagg: --workspace <id|ref|index> Målrett vinduet som inneholder et arbeidsområde --window <id|ref|index> Målrett et vindu --no-focus Med innstilt, bytt modus uten å flytte fokus Eksempler: cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode
pl: Użycie: cmux right-sidebar <command> [flags] Kontroluj prawy pasek boczny z CLI. Polecenia: toggle Przełącz widoczność prawego paska bocznego show Pokaż prawy pasek boczny hide Ukryj prawy pasek boczny focus Ustaw bieżący tryb prawego paska bocznego set <files|find|vault|sessions|feed|dock> Pokaż, przełącz tryb i ustaw ostrość mode Drukuj {"visible":bool,"mode":string} files|find|vault|sessions|feed|dock Alias dla show + set + focus Flagi: --workspace <id|ref|index> Wybierz okno zawierające obszar roboczy --window <id|ref|index> Wybierz okno --no-focus Po ustawieniu przełącza tryb bez przenoszenia fokusu Przykłady: cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode
pt_br: Uso: cmux right-sidebar <command> [flags] Controle a barra lateral direita em CLI. Comandos: toggle Alternar a visibilidade da barra lateral direita show Mostrar a barra lateral direita hide Ocultar a barra lateral direita focus Focar o modo atual da barra lateral direita set <files|find|vault|sessions|feed|dock> Mostrar, alternar modo e focar mode Imprimir {"visible":bool,"mode":string} files|find|vault|sessions|feed|dock Alias para show + set + focus Bandeiras: --workspace <id|ref|index> Direcione a janela que contém um espaço de trabalho --window <id|ref|index> Segmentar uma janela --no-focus Com definido, alterne o modo sem mover o foco Exemplos: cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode
ru: Использование: cmux right-sidebar <command> [flags] Управляйте правой боковой панелью с помощью CLI. Команды: toggle Переключить видимость правой боковой панели show Показать правую боковую панель hide Скрыть правую боковую панель focus Фокус текущего режима правой боковой панели set <files|find|vault|sessions|feed|dock> Показ, переключение режима и фокусировка mode Распечатать {"visible":bool,"mode":string} files|find|vault|sessions|feed|dock Псевдоним для show + set + focus Флаги: --workspace <id|ref|index> Выберите окно, содержащее рабочую область. --window <id|ref|index> Выберите окно --no-focus При установке переключение режима без перемещения фокуса Примеры: cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode
th: การใช้งาน: cmux right-sidebar <command> [flags] ควบคุมแถบด้านข้างขวาจาก CLI คำสั่ง: toggle สลับการมองเห็นแถบด้านข้างขวา show แสดงแถบด้านข้างขวา hide ซ่อนแถบด้านข้างขวา focus โฟกัสโหมดแถบด้านข้างขวาปัจจุบัน set <files|find|vault|sessions|feed|dock> แสดง สลับโหมด และโฟกัส mode พิมพ์ {"visible":bool,"mode":string} files|find|vault|sessions|feed|dock นามแฝงสำหรับ show + set + focus ธง: --workspace <id|ref|index> กำหนดเป้าหมายหน้าต่างที่มีพื้นที่ทำงาน --window <id|ref|index> กำหนดเป้าหมายหน้าต่าง --no-focus ด้วยการตั้งค่า สลับโหมดโดยไม่ย้ายโฟกัส ตัวอย่าง: cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode
tr: Kullanım: cmux right-sidebar <command> [flags] Sağ kenar çubuğunu CLI'den kontrol edin. Komutlar: toggle Sağ kenar çubuğu görünürlüğünü değiştir show Sağ kenar çubuğunu göster hide Sağ kenar çubuğunu gizle focus Geçerli sağ kenar çubuğu moduna odaklanın set <files|find|vault|sessions|feed|dock> Göster, modu değiştir ve odaklan mode Yazdır {"visible":bool,"mode":string} files|find|vault|sessions|feed|dock show + set + focus takma adı Bayraklar: --workspace <id|ref|index> Çalışma alanı içeren pencereyi hedefleyin --window <id|ref|index> Bir pencereyi hedefleme --no-focus Ayarla, odağı hareket ettirmeden geçiş modu Örnekler: cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode
uk: Використання: cmux right-sidebar <command> [flags] Керуйте правою бічною панеллю з CLI. Команди: toggle Перемкнути видимість правої бічної панелі show Показати праву бічну панель hide Приховати праву бічну панель focus Перейти до поточного режиму правої бічної панелі set <files|find|vault|sessions|feed|dock> Показати, переключити режим і фокус mode Друк {"visible":bool,"mode":string} files|find|vault|sessions|feed|dock Псевдонім для show + set + focus Прапори: --workspace <id|ref|index> Націльте вікно, що містить робочу область --window <id|ref|index> Націлити вікно --no-focus Якщо встановлено, перемикайте режим без переміщення фокуса приклади: cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode
zh_hans: 用法：cmux right-sidebar <command> [flags] 从CLI控制右侧边栏。 命令： toggle 切换右侧边栏可见性 show 显示右侧边栏 hide 隐藏右侧边栏 focus 聚焦当前右侧边栏模式 set <files|find|vault|sessions|feed|dock> 显示、切换模式和焦点 mode打印{"visible":bool,"mode":string} files|find|vault|sessions|feed|dock show + set + focus 的别名 标志： --workspace <id|ref|index> 以包含工作区的窗口为目标 --window <id|ref|index> 定位窗口 --no-focus 带设置，切换模式无需移动焦点 示例： cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode
zh_hant: 用法：cmux right-sidebar <command> [flags] 從CLI控制右側邊欄。 命令： toggle 切換右側邊欄可見性 show 顯示右側邊欄 hide 隱藏右側邊欄 focus 聚焦目前右側邊欄模式 set <files|find|vault|sessions|feed|dock> 顯示、切換模式和焦點 mode列印{"visible":bool,"mode":string} files|find|vault|sessions|feed|dock show + set + focus 的別名 標誌： --workspace <id|ref|index> 以包含工作區的視窗為目標 --window <id|ref|index> 定位窗口 --no-focus 帶設置，切換模式無需移動焦點 範例： cmux right-sidebar toggle cmux right-sidebar set find cmux right-sidebar set vault --no-focus cmux right-sidebar mode
